dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEdsadc_bf.h
/**
 * \file IfxEdsadc_bf.h
 * \brief
 * \version iLLD_1_21_0
 * \copyright Copyright (c) 2024 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC37xED_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Use of this file is subject to the terms of use agreed between (i) you or 
 * the company in which ordinary course of business you are acting and (ii) 
 * Infineon Technologies AG or its licensees. If and as long as no such 
 * terms of use are agreed, use of this file is subject to following:


 * Boost Software License - Version 1.0 - August 17th, 2003

 * Permission is hereby granted, free of charge, to any person or 
 * organization obtaining a copy of the software and accompanying 
 * documentation covered by this license (the "Software") to use, reproduce,
 * display, distribute, execute, and transmit the Software, and to prepare
 * derivative works of the Software, and to permit third-parties to whom the 
 * Software is furnished to do so, all subject to the following:

 * The copyright notices in the Software and this entire statement, including
 * the above license grant, this restriction and the following disclaimer, must
 * be included in all copies of the Software, in whole or in part, and all
 * derivative works of the Software, unless such copies or derivative works are
 * solely in the form of machine-executable object code generated by a source
 * language processor.

 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR 
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE, TITLE AND NON-INFRINGEMENT. IN NO EVENT
 * SHALL THE COPYRIGHT HOLDERS OR ANYONE DISTRIBUTING THE SOFTWARE BE LIABLE 
 * FOR ANY DAMAGES OR OTHER LIABILITY, WHETHER IN CONTRACT, TORT OR OTHERWISE,
 * ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
 * DEALINGS IN THE SOFTWARE.
 *
 * \defgroup IfxSfr_Edsadc_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Edsadc_Registers
 * 
 */
#ifndef IFXEDSADC_BF_H
#define IFXEDSADC_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Edsadc_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_EDSADC_CLC_Bits.DISR */
#define IFX_EDSADC_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CLC_Bits.DISR */
#define IFX_EDSADC_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CLC_Bits.DISR */
#define IFX_EDSADC_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_EDSADC_CLC_Bits.DISS */
#define IFX_EDSADC_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CLC_Bits.DISS */
#define IFX_EDSADC_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CLC_Bits.DISS */
#define IFX_EDSADC_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_EDSADC_CLC_Bits.EDIS */
#define IFX_EDSADC_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CLC_Bits.EDIS */
#define IFX_EDSADC_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CLC_Bits.EDIS */
#define IFX_EDSADC_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_EDSADC_ID_Bits.MOD_REV */
#define IFX_EDSADC_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_EDSADC_ID_Bits.MOD_REV */
#define IFX_EDSADC_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_EDSADC_ID_Bits.MOD_REV */
#define IFX_EDSADC_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_EDSADC_ID_Bits.MOD_TYPE */
#define IFX_EDSADC_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_EDSADC_ID_Bits.MOD_TYPE */
#define IFX_EDSADC_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_EDSADC_ID_Bits.MOD_TYPE */
#define IFX_EDSADC_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_EDSADC_ID_Bits.MOD_NUMBER */
#define IFX_EDSADC_ID_MOD_NUMBER_LEN (16u)

/** \brief Mask for Ifx_EDSADC_ID_Bits.MOD_NUMBER */
#define IFX_EDSADC_ID_MOD_NUMBER_MSK (0xffffu)

/** \brief Offset for Ifx_EDSADC_ID_Bits.MOD_NUMBER */
#define IFX_EDSADC_ID_MOD_NUMBER_OFF (16u)

/** \brief Length for Ifx_EDSADC_OCS_Bits.SUS */
#define IFX_EDSADC_OCS_SUS_LEN (4u)

/** \brief Mask for Ifx_EDSADC_OCS_Bits.SUS */
#define IFX_EDSADC_OCS_SUS_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_OCS_Bits.SUS */
#define IFX_EDSADC_OCS_SUS_OFF (24u)

/** \brief Length for Ifx_EDSADC_OCS_Bits.SUS_P */
#define IFX_EDSADC_OCS_SUS_P_LEN (1u)

/** \brief Mask for Ifx_EDSADC_OCS_Bits.SUS_P */
#define IFX_EDSADC_OCS_SUS_P_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_OCS_Bits.SUS_P */
#define IFX_EDSADC_OCS_SUS_P_OFF (28u)

/** \brief Length for Ifx_EDSADC_OCS_Bits.SUSSTA */
#define IFX_EDSADC_OCS_SUSSTA_LEN (1u)

/** \brief Mask for Ifx_EDSADC_OCS_Bits.SUSSTA */
#define IFX_EDSADC_OCS_SUSSTA_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_OCS_Bits.SUSSTA */
#define IFX_EDSADC_OCS_SUSSTA_OFF (29u)

/** \brief Length for Ifx_EDSADC_KRSTCLR_Bits.CLR */
#define IFX_EDSADC_KRSTCLR_CLR_LEN (1u)

/** \brief Mask for Ifx_EDSADC_KRSTCLR_Bits.CLR */
#define IFX_EDSADC_KRSTCLR_CLR_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_KRSTCLR_Bits.CLR */
#define IFX_EDSADC_KRSTCLR_CLR_OFF (0u)

/** \brief Length for Ifx_EDSADC_KRST1_Bits.RST */
#define IFX_EDSADC_KRST1_RST_LEN (1u)

/** \brief Mask for Ifx_EDSADC_KRST1_Bits.RST */
#define IFX_EDSADC_KRST1_RST_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_KRST1_Bits.RST */
#define IFX_EDSADC_KRST1_RST_OFF (0u)

/** \brief Length for Ifx_EDSADC_KRST0_Bits.RST */
#define IFX_EDSADC_KRST0_RST_LEN (1u)

/** \brief Mask for Ifx_EDSADC_KRST0_Bits.RST */
#define IFX_EDSADC_KRST0_RST_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_KRST0_Bits.RST */
#define IFX_EDSADC_KRST0_RST_OFF (0u)

/** \brief Length for Ifx_EDSADC_KRST0_Bits.RSTSTAT */
#define IFX_EDSADC_KRST0_RSTSTAT_LEN (1u)

/** \brief Mask for Ifx_EDSADC_KRST0_Bits.RSTSTAT */
#define IFX_EDSADC_KRST0_RSTSTAT_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_KRST0_Bits.RSTSTAT */
#define IFX_EDSADC_KRST0_RSTSTAT_OFF (1u)

/** \brief Length for Ifx_EDSADC_ACCEN0_Bits.EN0 */
#define IFX_EDSADC_ACCEN0_EN0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_ACCEN0_Bits.EN0 */
#define IFX_EDSADC_ACCEN0_EN0_MSK (0x1u)

