dturcu/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC37xED/IfxEdsadc_bf.h
/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_EDSADC_EVFLAGCLR_RESEC5_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.RESEC5 */
#define IFX_EDSADC_EVFLAGCLR_RESEC5_OFF (5u)

/** \brief Length for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_EDSADC_EVFLAGCLR_ALEC0_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_EDSADC_EVFLAGCLR_ALEC0_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC0 */
#define IFX_EDSADC_EVFLAGCLR_ALEC0_OFF (16u)

/** \brief Length for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_EDSADC_EVFLAGCLR_ALEC1_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_EDSADC_EVFLAGCLR_ALEC1_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC1 */
#define IFX_EDSADC_EVFLAGCLR_ALEC1_OFF (17u)

/** \brief Length for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_EDSADC_EVFLAGCLR_ALEC2_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_EDSADC_EVFLAGCLR_ALEC2_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC2 */
#define IFX_EDSADC_EVFLAGCLR_ALEC2_OFF (18u)

/** \brief Length for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_EDSADC_EVFLAGCLR_ALEC3_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_EDSADC_EVFLAGCLR_ALEC3_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC3 */
#define IFX_EDSADC_EVFLAGCLR_ALEC3_OFF (19u)

/** \brief Length for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_EDSADC_EVFLAGCLR_ALEC4_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_EDSADC_EVFLAGCLR_ALEC4_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC4 */
#define IFX_EDSADC_EVFLAGCLR_ALEC4_OFF (20u)

/** \brief Length for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_EDSADC_EVFLAGCLR_ALEC5_LEN (1u)

/** \brief Mask for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_EDSADC_EVFLAGCLR_ALEC5_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_EVFLAGCLR_Bits.ALEC5 */
#define IFX_EDSADC_EVFLAGCLR_ALEC5_OFF (21u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_EDSADC_CH_MODCFG_INCFGP_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_EDSADC_CH_MODCFG_INCFGP_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INCFGP */
#define IFX_EDSADC_CH_MODCFG_INCFGP_OFF (0u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_EDSADC_CH_MODCFG_INCFGN_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_EDSADC_CH_MODCFG_INCFGN_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INCFGN */
#define IFX_EDSADC_CH_MODCFG_INCFGN_OFF (2u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_EDSADC_CH_MODCFG_GAINSEL_LEN (4u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_EDSADC_CH_MODCFG_GAINSEL_MSK (0xfu)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.GAINSEL */
#define IFX_EDSADC_CH_MODCFG_GAINSEL_OFF (4u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INSEL */
#define IFX_EDSADC_CH_MODCFG_INSEL_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INSEL */
#define IFX_EDSADC_CH_MODCFG_INSEL_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INSEL */
#define IFX_EDSADC_CH_MODCFG_INSEL_OFF (8u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INMUX */
#define IFX_EDSADC_CH_MODCFG_INMUX_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INMUX */
#define IFX_EDSADC_CH_MODCFG_INMUX_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INMUX */
#define IFX_EDSADC_CH_MODCFG_INMUX_OFF (10u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INMODE */
#define IFX_EDSADC_CH_MODCFG_INMODE_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INMODE */
#define IFX_EDSADC_CH_MODCFG_INMODE_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INMODE */
#define IFX_EDSADC_CH_MODCFG_INMODE_OFF (12u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INMAC */
#define IFX_EDSADC_CH_MODCFG_INMAC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INMAC */
#define IFX_EDSADC_CH_MODCFG_INMAC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INMAC */
#define IFX_EDSADC_CH_MODCFG_INMAC_OFF (14u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.INCWC */
#define IFX_EDSADC_CH_MODCFG_INCWC_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.INCWC */
#define IFX_EDSADC_CH_MODCFG_INCWC_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.INCWC */
#define IFX_EDSADC_CH_MODCFG_INCWC_OFF (15u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.DIVM */
#define IFX_EDSADC_CH_MODCFG_DIVM_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.DIVM */
#define IFX_EDSADC_CH_MODCFG_DIVM_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.DIVM */
#define IFX_EDSADC_CH_MODCFG_DIVM_OFF (16u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.ACSD */
#define IFX_EDSADC_CH_MODCFG_ACSD_LEN (3u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.ACSD */
#define IFX_EDSADC_CH_MODCFG_ACSD_MSK (0x7u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.ACSD */
#define IFX_EDSADC_CH_MODCFG_ACSD_OFF (20u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.DITHEN */
#define IFX_EDSADC_CH_MODCFG_DITHEN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.DITHEN */
#define IFX_EDSADC_CH_MODCFG_DITHEN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.DITHEN */
#define IFX_EDSADC_CH_MODCFG_DITHEN_OFF (26u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.IREN */
#define IFX_EDSADC_CH_MODCFG_IREN_LEN (1u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.IREN */
#define IFX_EDSADC_CH_MODCFG_IREN_MSK (0x1u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.IREN */
#define IFX_EDSADC_CH_MODCFG_IREN_OFF (27u)

/** \brief Length for Ifx_EDSADC_CH_MODCFG_Bits.APC */
#define IFX_EDSADC_CH_MODCFG_APC_LEN (2u)

/** \brief Mask for Ifx_EDSADC_CH_MODCFG_Bits.APC */
#define IFX_EDSADC_CH_MODCFG_APC_MSK (0x3u)

/** \brief Offset for Ifx_EDSADC_CH_MODCFG_Bits.APC */
#define IFX_EDSADC_CH_MODCFG_APC_OFF (28u)

